cases/BWRX300/0.org/U.steam
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    object      U.steam;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    "inlet.*"
    {
        type            fixedValue;
        value           uniform (0 0 1.149);
    }

    outlet
    {
        type            pressureInletOutletVelocity;
        phi             phi.steam;
        value           $internalField;
    }

    "wall.*"
    {
        type            slip;
    }

    "symm.*"
    {
        type            symmetry;
    }
}
