cases/BWRX300/0.org/alpha.steam
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.steam;
}

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1e-5;

boundaryField
{
    inlet_low
    {
        type            fixedValue;
        value           $internalField;
    }

    inlet_medium
    {
        type            uniformFixedValue;
        value           $internalField;
        uniformValue    table
        (
            (0.0 1e-5)
            (0.5 0.625)
        );
    }

    inlet_high
    {
        type            uniformFixedValue;
        value           $internalField;
        uniformValue    table
        (
            (0.0 1e-5)
            (0.5 0.751)
        );
    }

    inlet_bypasses
    {
        $inlet_low
    }

    outlet
    {
        type            zeroGradient;
    }

    "wall.*"
    {
        type            zeroGradient;
    }

    "symm.*"
    {
        type            symmetry;
    }
}
