cases/BWRX300/0.org/epsilon.steam
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon.steam;
}

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1.5e-4;

boundaryField
{
    "inlet.*"
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            zeroGradient;
    }

    "wall.*"
    {
        type            epsilonWallFunction;
        value           $internalField;
    }

    "symm.*"
    {
        type            symmetry;
    }
}
