cases/BWRX300/0.org/k.water
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k.water;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 3.75e-5;

boundaryField
{
    "inlet.*"
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            zeroGradient;
    }

    "wall.*"
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    "symm.*"
    {
        type            symmetry;
    }
}

sources
{
    phaseChange
    {
        type            uniformFixedValue;
        uniformValue    $internalField;
    }
}
