cases/BWRX300/0.org/nut.water
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut.water;
}

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-8;

boundaryField
{
    "inlet.*"
    {
        type            calculated;
        value           $internalField;
    }

    outlet
    {
        type            calculated;
        value           $internalField;
    }

    "wall.*"
    {
        type            nutkWallFunction;
        value           $internalField;
    }

    "symm.*"
    {
        type            symmetry;
    }
}
