cases/BWRX300/0.org/omega.water
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega.water;
}

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 100;

boundaryField
{
    "inlet.*"
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            zeroGradient;
    }

    "wall.*"
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    "symm.*"
    {
        type            symmetry;
    }
}
