cases/BWRX300/0.org/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions          [1 -1 -2 0 0 0 0];

internalField       uniform 7.17e6;

boundaryField
{
    "inlet.*"
    {
        type            calculated;
        value           $internalField;
    }

    outlet
    {
        type            calculated;
        value           $internalField;
    }

    "wall.*"
    {
        type            calculated;
        value           $internalField;
    }

    "symm.*"
    {
        type            symmetry;
    }
}
