cases/BWRX300/constant/heatTransfer.LogMoM.m4
FoamFile
{
    format      ascii;
    class       dictionary;
    object      heatTransfer;
}

steam_dispersedIn_water_inThe_water
{
    type            LogMoM;

    mode            quadrature;
    GaussHermite    3;

    heatTransfer
    {
        type        VARHEATMODEL;

        #include    "saturationTemperature"
        mDot        phaseChange:mDot;
        firstPhase  steam;
    }
}

steam_dispersedIn_water_inThe_steam
{
    type            LogMoM;

    mode            quadrature;
    GaussHermite    3;

    heatTransfer
    {
        type        VARHEATMODEL;

        #include    "saturationTemperature"
        mDot        phaseChange:mDot;
        firstPhase  steam;
    }
}

water_dispersedIn_steam_inThe_water
{
    type    spherical;
}

water_dispersedIn_steam_inThe_steam
{
    type    spherical;
}
