cases/BWRX300/constant/momentumTransfer.FPT
FoamFile
{
    format      ascii;
    class       dictionary;
    object      momentumTransfer;
}

drag
{
    steam_dispersedIn_water
    {
        type        IshiiZuber;
    }

    water_dispersedIn_steam
    {
        type        SchillerNaumann;
        residualRe  1e-3;
    }

    steam_segregatedWith_water
    {
        type    segregated;
        m       0.5;
        n       8;
    }
}

virtualMass
{
    steam_dispersedIn_water
    {
        type    constantCoefficient;
        Cvm     0.5;
    }

    water_dispersedIn_steam
    {
        type    constantCoefficient;
        Cvm     0.5;
    }
}

lift
{
    steam_dispersedIn_water
    {
        type    wallDamped;

        lift
        {
            type    Tomiyama;

            aspectRatio
            {
                type    Wellek;
            }
        }

        wallDamping
        {
            type            cosine;
            Cd              1.0;
            zeroWallDist    0;
        }
    }

    water_dispersedIn_steam
    {
        type    none;
    }
}

wallLubrication
{
    steam_dispersedIn_water
    {
        type    Antal;
        Cw1     -0.01;
        Cw2     0.05;
    }

    water_dispersedIn_steam
    {
        type    none;
    }
}

turbulentDispersion
{
    steam_dispersedIn_water
    {
        type    Burns;
        sigma   1;
    }

    water_dispersedIn_steam
    {
        type    none;
    }
}
