cases/BWRX300/constant/phaseProperties.LogMoM
FoamFile
{
    format      ascii;
    class       dictionary;
    object      phaseProperties;
}

phases (steam water);

steam
{
    type            purePhaseModel;

    diameterModel   LogMoM;

    LogMoMCoeffs
    {
        dMax            3e-1;
        dMin            1e-4;

        nCorr           3;

        continuousPhase water;

        sources
        (
            coalescence
            {
                type            LehrMilliesMewes;
                GaussHermite    3;
            }

            breakup
            {
                type            LehrMilliesMewes;
                GaussHermite    3;
                GaussLegendre   5;
            }
        );
    }

    residualAlpha   1e-6;
}

water
{
    type            purePhaseModel;

    diameterModel   constant;

    constantCoeffs
    {
        d           1e-3;
    }

    residualAlpha   1e-6;
}

blending
{
    default
    {
        type            linear;
        minFullyContinuousAlpha.steam 0.7;
        minPartlyContinuousAlpha.steam 0.3;
        minFullyContinuousAlpha.water 0.7;
        minPartlyContinuousAlpha.water 0.3;
    }

    drag
    {
        type            linear;
        minFullyContinuousAlpha.steam 0.7;
        minPartlyContinuousAlpha.steam 0.5;
        minFullyContinuousAlpha.water 0.7;
        minPartlyContinuousAlpha.water 0.5;
    }

    heatTransfer
    {
        type            linear;
        minFullyContinuousAlpha.steam 1;
        minPartlyContinuousAlpha.steam 0;
        minFullyContinuousAlpha.water 1;
        minPartlyContinuousAlpha.water 0;
    }
}

surfaceTension
{
    steam_water
    {
        type    constant;
        sigma   0.03;
    }
}

interfaceCompression
{}

aspectRatio
{
    steam_dispersedIn_water
    {
        type Wellek;
    }
}
