cases/BWRX300/constant/saturationTemperature
saturationTemperature
{
    type    constant;
    value   560.15;
}
