cases/BWRX300/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (0 0 0)
    (0.0960139398 0 0.004192059145)
    (0.0960139398 8.0 0.004192059145)
    (0 8.0 0)
    (0.0960139398 0 -0.004192059145)
    (0.0960139398 8.0 -0.004192059145)
    (0.0974072016 0 0.004252890268)
    (0.0974072016 0 -0.004252890268)
    (0.0974072016 8.0 -0.004252890268)
    (0.0974072016 8.0 0.004252890268)

);

blocks
(
    hex (0 6 7 0 3 9 8 3) (16 1 256) simpleGrading (1 1 1)
);

edges
();

boundary
(
    wedgeFront
    {
        type    wedge;
        faces
        (
            (0 6 9 3)
        );
    }
    wedgeBack
    {
        type    wedge;
        faces
        (
            (0 3 8 7)
        );
    }
    walls
    {
        type    wall;
        faces
        (
            (6 7 8 9)
        );
    }
    inlet
    {
        type    patch;
        faces
        (
            (0 7 6 0)
        );
    }
    outlet
    {
        type    patch;
        faces
        (
            (3 8 9 3)
        );
    }
    axis
    {
        type    empty;
        faces
        (
            (0 3 3 0)
        );
    }
);
