cases/BWRX300/system/functions.FPT
// Write fields

#includeFunc    writeObjects(d.steam)
#includeFunc    writeObjects(rho.steam)
