cases/BWRX300/system/functions.LogMoM
// Write fields

#includeFunc    writeObjects(d.steam)
#includeFunc    writeObjects(sigma.steam)
#includeFunc    writeObjects(rho.steam)
